|             nombre | apellido | empresa |     seguimos editando |
|--------------------+----------+---------+-----------------------|
| esto es una prueba |          |         |                       |
|                    |          |         | pues menuda mierda no |
|                    |          |         |                       |
|--------------------+----------+---------+-----------------------|
|                    |          |         |                       |
|                  5 |        5 |       5 |                    15 |
|                 10 |       10 |      10 |                    30 |
|                 20 |      356 |      17 |                   393 |
|           prorrata |          |         |                  65.5 |
|                    |          |         |                       |
#+TBLFM: $4=@-1*2/12::@6$4..@8$4='(apply' +'($1..$3));N


| codigo hamming | ji |
|----------------+----|
|                |    |


array

|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
|    | p1 | p2 | d1 | d2 | p3 | d3 | d4 | d5 | p4 | d6 | d7 | explicacion salto        | calculo | salto |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
|    | 0  | 0  |  1 | 0  |  0 |  1 |  1 | 1  |  1 |  1 |  1 |                          |         |       |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
| p1 | 0  | ?  |  1 | ?  |  0 |  ? |  1 | ?  |  1 |  ? |  1 | el salto esta en 1       |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | entonces empezamos       |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | 1-1=0 empieza elemento 0 | 2**0    |     1 |
|    |    |    |    |    |    |    |    |    |    |    |    | auxiliar 0               |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | y empezamos 1 si 1 no    |         |       |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
| p2 | ?  | 0  |  1 | ?  |  ? |  1 |  1 | ?  |  ? |  1 |  1 | el salto esta en 2       | 2**1    |     2 |
|    |    |    |    |    |    |    |    |    |    |    |    | entonces empezamos 2-1=1 |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | empieza elemento 1       |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | auxiliar 1 y empezamos   |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | 2 si 2 no                |         |       |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
| p3 | ?  | ?  |  ? | 0  |  0 |  1 |  1 | ?  |  ? |  ? |  ? | el salto esta en 4       | 2**2    |     4 |
|    |    |    |    |    |    |    |    |    |    |    |    | entonces empezamos 4-1=3 |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | empieza elemento 3       |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | auxiliar 3 y empezamos   |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | 4 si 4 no                |         |       |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
| p4 | ?  | ?  |  ? | ?  |  ? |  ? |  ? | 1  |  1 |  1 |  1 | el salto esta en 8       | 2**3    |     8 |
|    |    |    |    |    |    |    |    |    |    |    |    | entonces empezamos 8-1=7 |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | empieza elemento 7       |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | auxiliar 7 y empezamos   |         |       |
|    |    |    |    |    |    |    |    |    |    |    |    | 8 si 8 no                |         |       |
|----+----+----+----+----+----+----+----+----+----+----+----+--------------------------+---------+-------|
#+TBLFM: @5$15=2**0::@8$15=2**0::@13$15=2**0::@18$15=2**0
el truco del almendruco

|-------+--------|
| salto | nsalto |
|-------+--------|
|     1 |      2 |
|-------+--------|


| extraido | string        | string temporal | string temporal | string        |                                 |
|        0 | "00100111111" | ""              | ""              | "00100111111" | esto es antes del bucle que n-1 |
|----------+---------------+-----------------+-----------------+---------------+---------------------------------|
|        1 | "00100111111" | "0"             | "0?"            | "100111111"   | empieza el bucle y ahora        |
|        1 | "100111111"   | "0?1"           | "0?1?"          | "0111111"     |                                 |
|        1 | "0111111"     | "0?1?0"         | "0?1?0?"        | "11111"       |                                 |
|        1 | "11111"       | "0?1?0?1"       | "0?1?0?1?"      | "111"         |                                 |
|        1 | "111"         | "0?1?0?1?1"     | "0?1?0?1?1?"    | "1"           |                                 |
|        1 | "1"           | "0?1?0?1?1?1"   | "0?1?0?1?1?1?"  | ""            | aqui nos sobraria un ? entonces |
|          |               |                 |                 |               | extraemos los 11 caracteres     |
|          |               |                 |                 |               | primeros y listo                |


|-------+--------|
| salto | nsalto |
|-------+--------|
|     2 |      4 |
|-------+--------|


| extraido | string        | string temporal | string temporal | string        |                                 |
|        1 | "00100111111" | ""              | ""              | "00100111111" | esto es antes del bucle que n-1 |
|----------+---------------+-----------------+-----------------+---------------+---------------------------------|
|        1 | "00100111111" | "0"             | "0?"            | "100111111"   | empieza el bucle y ahora        |
|        1 | "100111111"   | "0?1"           | "0?1?"          | "0111111"     |                                 |
|        1 | "0111111"     | "0?1?0"         | "0?1?0?"        | "11111"       |                                 |
|        1 | "11111"       | "0?1?0?1"       | "0?1?0?1?"      | "111"         |                                 |
|        1 | "111"         | "0?1?0?1?1"     | "0?1?0?1?1?"    | "1"           |                                 |
|        1 | "1"           | "0?1?0?1?1?1"   | "0?1?0?1?1?1?"  | ""            | aqui nos sobraria un ? entonces |
|          |               |                 |                 |               | extraemos los 11 caracteres     |
|          |               |                 |                 |               | primeros y listo                |
